it/src/Documents/ПоступлениеОС/ПоступлениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеОС</name>
  <registerRecords>AccumulationRegister.РазмещениеОбъектов</registerRecords>
  <registerRecords>InformationRegister.ПоддержкаЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОС</registerRecords>
  <registerRecords>InformationRegister.ОтключенныеКомпьютеры</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговораКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОСВладелец</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяДомена</name>
      <type>
        <types>CatalogRef.ИдентификаторыДоменов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Documents/ПоступлениеОС/Forms/ФормаДокумента/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// Переменные
// 

&НаКлиенте
Перем АдресЛицензийВХранилище;


&НаСервере
Процедура ЗаполнитьСтоимостьНаСервере()
	
	ОбщегоНазначенияСервер.ЗаполнитьОсновныеСредстваСтоимостью(Объект, Истина, Ложь);	
	
КонецПроцедуры

// Функция помещает список товаров во временное хранилище и возвращает адрес 
&НаСервере
Функция ПоместитьЛицензииВХранилище() 
	Возврат ПоместитьВоВременноеХранилище(Объект.ОсновныеСредства.Выгрузить(,"ОсновноеСредство, Количество, Стоимость"), УникальныйИдентификатор);
КонецФункции

// Функция восстанавливает список товаров из временного хранилища
&НаСервере
Процедура ПолучитьЛицензииИзХранилища(АдресЛицензийВХранилище)
	Объект.ОсновныеСредства.Загрузить(ПолучитьИзВременногоХранилища(АдресЛицензийВХранилище));
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСтоимость(Команда)
	ЗаполнитьСтоимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	АдресЛицензийВХранилище = ПоместитьЛицензииВХранилище();
	ПараметрыПодбора = Новый Структура("АдресЛицензийДокумента, Организация, Контрагент", АдресЛицензийВХранилище, Объект.Организация, Объект.Контрагент);
	ПараметрыПодбора.Вставить("РежимВыбора", Истина);
	ФормаПодбора = ОткрытьФорму("Документ.ПоступлениеОС.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПодбор() Экспорт
	
	ПолучитьЛицензииИзХранилища(АдресЛицензийВХранилище);  
	
КонецПроцедуры
